tests/saved_cases/tiny-tgv/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application       icoFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           0.3;

deltaT            0.05;

writeControl      adjustableRunTime;

writeInterval     0.05;

purgeWrite        0;

writeFormat       ascii;

writePrecision    12;

writeCompression  off;

timeFormat        general;

timePrecision     12;

runTimeModifiable  true;

functions
{
    minmaxdomain
    {
        type fieldMinMax;
        //type banana;

        libs ("libfieldFunctionObjects.so");

        enabled true;

        mode component;

        writeControl timeStep;
        writeInterval 1;

        log true;

        fields (p U);
    }
};
